Repository: Bayrambek770/tech-store
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: That page number is less than 1
uz: Sahifa raqami 1 dan kichik

source: That page contains no results
uz: Bu sahifada natijalar yo'q

source: Enter a valid value.
uz: Yaroqli qiymat kiriting.

source: Enter a valid domain name.
uz: Yaroqli domen nomini kiriting.

source: Enter a valid URL.
uz: Yaroqli URL kiriting.

source: Enter a valid integer.
uz: Yaroqli butun son kiriting.

source: Enter a valid email address.
uz: Yaroqli elektron pochta manzilini kiriting.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
uz: Harf, raqam, pastki chiziq yoki defisdan iborat yaroqli 'slug' kiriting.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
uz: Unicode harflari, raqamlar, pastki chiziqlar yoki defislardan iborat yaroqli 'slug' kiriting.

source: Enter a valid %(protocol)s address.
uz: Yaroqli %(protocol)s manzilini kiriting.

source: IPv4 or IPv6
uz: IPv4 yoki IPv6

source: Enter only digits separated by commas.
uz: Faqat vergul bilan ajratilgan raqamlarni kiriting.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
uz: Bu qiymat %(limit_value)s bo'lishi kerak (hozir %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
uz: Qiymat %(limit_value)s dan kichik yoki teng bo'lishi kerak.

source: Ensure this value is greater than or equal to %(limit_value)s.
uz: Qiymat %(limit_value)s dan katta yoki teng bo'lishi kerak.

source: Ensure this value is a multiple of step size %(limit_value)s.
uz: Qiymat %(limit_value)s qadam o'lchamining karrali bo'lishi kerak.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
uz: Qiymat %(offset)s dan boshlab %(limit_value)s qadam o'lchamining karrali bo'lishi kerak, masalan: %(offset)s, %(valid_value1)s, %(valid_value2)s va hokazo.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
uz: Qiymat kamida %(limit_value)d ta belgidan iborat bo'lishi kerak (hozir %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
uz: Qiymat eng ko'p %(limit_value)d ta belgi bo'lishi mumkin (hozir %(show_value)d).

source: Enter a number.
uz: Raqam kiriting.

source: Ensure that there are no more than %(max)s digit in total.
uz: Umumiy raqamlar soni %(max)s tadan oshmasligi kerak.

source: Ensure that there are no more than %(max)s decimal place.
uz: O'nli kasrlar soni %(max)s tadan oshmasligi kerak.

source: Ensure that there are no more than %(max)s digit before the decimal point.
uz: Nuqtadan oldingi raqamlar soni %(max)s tadan oshmasligi kerak.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
uz: “%(extension)s” fayl kengaytmasiga ruxsat berilmaydi. Ruxsat etilgan kengaytmalar: %(allowed_extensions)s.

source: Null characters are not allowed.
uz: Nol belgilariga ruxsat berilmaydi.
