Repository: Bayrambek770/tech-store
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Design Marketplace
uz: Dizayn bozori

source: All Types
uz: Barcha turlari

source: 3D Max Products
uz: 3D Max mahsulotlari

source: Interior Design
uz: Ichki dizayn

source: Search...
uz: Qidirish...

source: Apply
uz: Qo'llash

source: Change language
uz: Tilni o'zgartirish

source: Select language
uz: Tilni tanlang

source: Russian
uz: Ruscha

source: English
uz: Inglizcha

source: Uzbek
uz: O'zbekcha

source: Name
uz: Nomi

source: Description
uz: Tavsif

source: Category
uz: Kategoriya

source: Categories
uz: Kategoriyalar

source: Price
uz: Narx

source: Discount (%)
uz: Chegirma (%)

source: Is active
uz: Faol

source: Product
uz: Mahsulot

source: Products
uz: Mahsulotlar

source: User
uz: Foydalanuvchi

source: Rating
uz: Reyting

source: Comment
uz: Izoh

source: Review
uz: Sharh

source: Reviews
uz: Sharhlar

source: Review for %(product)s by %(user)s
uz: %(user)s tomonidan %(product)s uchun sharh

source: Cart
uz: Savat

source: Shopping Cart
uz: Xarid savati

source: Review your selected items
uz: Tanlangan mahsulotlarni ko'rib chiqing

source: Image
uz: Rasm

source: Quantity
uz: Soni

source: Total
uz: Jami

source: Remove
uz: O'chirish

source: No Img
uz: Rasm yo'q

source: Design
uz: Dizayn

source: Advance
uz: Oldindan to'lov

source: Your cart is empty.
uz: Savatingiz bo'sh.

source: Subtotal:
uz: Oraliq jami:

source: Continue Shopping
uz: Xaridni davom ettirish

source: Proceed to Checkout
uz: To'lovga o'tish

source: Checkout
uz: To'lov

source: Shipping & Contact
uz: Yuk va aloqa

source: First Name
uz: Ism

source: Last Name
uz: Familiya

source: Phone
uz: Telefon

source: Address Line 1
uz: Manzil 1-qator

source: 123 Main St
uz: Asosiy ko'cha 123

source: Address Line 2
uz: Manzil 2-qator

source: Optional
uz: Ixtiyoriy

source: Country
uz: Mamlakat

source: State/Region
uz: Viloyat

source: State / Region
uz: Viloyat

source: ZIP
uz: Indeks

source: Payment
uz: To'lov

source: Credit / Debit Card
uz: Kredit / Debet karta

source: Cash on Delivery
uz: Yetkazilganda naqd

source: Card Number
uz: Karta raqami

source: Expiry (MM/YY)
uz: Amal muddati (OY/YIL)

source: Your card data is secured.
uz: Kartangiz ma'lumotlari himoyalangan.

source: Order Summary
uz: Buyurtma xulosasi

source: Total:
uz: Jami:

source: Pay Now
uz: To'lash

source: Advance Payment
uz: Oldindan to'lov

source: Making an advance payment
uz: Oldindan to'lov kiritish

source: Enter any positive amount and optionally increase the quantity if you wish to multiply it. This will appear in your cart as a separate line.
uz: Musbat son kiriting va ixtiyoriy miqdorni oshiring

source: Amount (USD)
uz: Miqdor (USD)

source: Add to Cart
uz: Savatga qo'shish

source: Back to Store
uz: Do'konga qaytish

source: This is treated like a product only for checkout purposes. Taxes / shipping do not apply.
uz: Bu faqat to'lov jarayoni uchun mahsulot sifatida qaraladi. Soliq va yetkazib berish qo'llanilmaydi.

source: Start your development with All for PC landing page.
uz: Loyihangizni All for PC landing sahifasidan boshlang.

source: Premium Components • Design Assets • Smart Advance Payments
uz: Yuqori kompanentlar, Dizayn tovarlar va Qulay oldindan to'lov

source: Learn more about OOO J&Z Shop section
uz: OOO J&Z Shop bo'limi haqida ko'proq bilish

source: Learn more
uz: Yana

source: Who are we ?
uz: Biz kimmiz

source: About Us
uz: Biz haqimizda

source: Welcome to the store with a funny name Snail. Why A Snail? Because we're small, but without fuss, we'll help you climb Mount Fuji! We offer everything you need to create gaming stations, work machines and servers: processors, graphics cards, RAM. Here you will find only proven brands – AMD, Intel, NVIDIA, ASUS, MSI and others, as well as exclusive offers that will help save.
uz: DARK AND WHITE ismli do'konga xush kelibsiz. Nima uchun DARK AND WHITE? Chunki biz kichkinamiz, lekin shov-shuvsiz Fudzi tog'iga chiqishingizga yordam beramiz! Biz sizga o'yin stantsiyalari, ish mashinalari va serverlarni yaratish uchun kerak bo'lgan hamma narsani taklif qilamiz: protsessorlar, grafik kartalar, RAM. Bu erda siz faqat tasdiqlangan brendlarni topasiz - AMD, Intel, NVIDIA, ASUS, MSI va boshqalar, shuningdek, tejashga yordam beradigan eksklyuziv takliflar.

source: Why choose us?
uz: Nega biz

source: Wide range
uz: Keng Assortiment

source: From budget solutions to top components for enthusiasts.
uz: Byudjet echimlaridan tortib, ishqibozlar uchun eng yaxshi komponentlargacha.

source: Fast delivery
uz: Tez yetkazib berish

source: Sending throughout Russia and the CIS as soon as possible.
uz: Iloji boricha tezroq Rossiya va MDH bo'ylab jo'natish.

source: Expert support
uz: Mutaxassis yordami

source: Our specialists will help you to choose components for your tasks.
uz: Bizning mutaxassislarimiz sizning vazifalaringiz uchun komponentlarni tanlashda yordam beradi.

source: Best Prices
uz: Eng yaxshi narxlar

source: Promotions, discounts and bonuses for regular customers.
uz: Doimiy mijozlar uchun aktsiyalar, chegirmalar va bonuslar.

source: Now in stock
uz: Hozir chegirmada

source: Hot offers
uz: Qaynoq takliflar

source: View %(name)s details
uz: %(name)s tafsilotlarini ko'rish

source: No image
uz: Rasm yo'q

source: Promo banner
uz: Aksiyaviy banner

source: Do not miss the chance to equip your PC at a bargain price
uz: Shaxsiy kompyuteringizni arzon narxda jihozlash imkoniyatini boy bermang

source: the promotion is valid until July 15, 2025!
uz: aksiya 2025-yil 15-iyulgacha amal qiladi!

source: Go Shopping
uz: Xarid qilish

source: Advance Pay
uz: Oldindan to'lov

source: How can you communicate?
uz: Qanday qilib muloqot qila olasiz?

source: Contact Us
uz: Biz bilan bog'lanish

source: Your Name
uz: Ismingiz

source: Your name
uz: Ismingiz

source: Enter Email
uz: Email kiriting

source: Email address
uz: Elektron pochta manzili

source: Write Something
uz: Xabar yozing

source: Message
uz: Xabar

source: Send Message
uz: Xabar yuborish

source: Send message
uz: Xabar yuborish

source: All for PC. All rights reserved.
uz: All for PC. Barcha huquqlar himoyalangan.

source: Public Offer
uz: Ommaviy oferta

source: Marketplace
uz: Bozor

source: Store
uz: Do'kon

source: Logged in user
uz: Tizimga kirgan foydalanuvchi

source: Account
uz: Hisob

source: Secure checkout • Easy returns • Fast support
uz: Xavfsiz to'lov • Oson qaytarish • Tezkor yordam

source: Related Products
uz: O'xshash mahsulotlar

source: Customer Reviews
uz: Mijozlar sharhlari

source: No reviews yet.
uz: Hozircha sharhlar yo'q.

source: Update Your Review
uz: Sharhingizni yangilang

source: Leave a Review
uz: Sharh qoldiring

source: Rating (1-5)
uz: Baholash (1-5)

source: Save Review
uz: Sharhni saqlash

source: Please correct the errors above.
uz: Iltimos, yuqoridagi xatolarni to'g'rilang.

source: Added
uz: Qo'shildi

source: Public Offer & Terms
uz: Ommaviy oferta va shartlar

source: LEGAL
uz: HUQUQIY

source: Public Offer & Terms of Service
uz: Ommaviy oferta va foydalanish shartlari

source: Contents
uz: Mundarija

source: 1. Acceptance of the Offer
uz: 1. Oferta qabul qilinishi

source: 2. Definitions
uz: 2. Ta'riflar

source: 3. Subject of the Agreement
uz: 3. Shartnoma predmeti

source: 4. Product Information & Availability
uz: 4. Mahsulot ma'lumoti va mavjudligi

source: 5. Prices, Discounts & Advance Payments
uz: 5. Narxlar, chegirmalar va oldindan to'lovlar

source: 6. Ordering Process
uz: 6. Buyurtma jarayoni

source: 7. Payment Methods & Security
uz: 7. To'lov usullari va xavfsizlik

source: 8. Delivery & Digital Assets
uz: 8. Yetkazib berish va raqamli aktivlar

source: 9. User Accounts & Security
uz: 9. Foydalanuvchi hisobi va xavfsizlik

source: 10. Reviews & User Content
uz: 10. Sharhlar va foydalanuvchi kontenti

source: 11. Intellectual Property
uz: 11. Intellektual mulk

source: 12. Warranty Disclaimer
uz: 12. Kafolat rad etilishi

source: 13. Returns, Refunds & Cancellations
uz: 13. Qaytarish, qayta to'lash va bekor qilish

source: 14. Advance / Donation Policy
uz: 14. Oldindan to'lov / xayriya siyosati

source: 15. Limitation of Liability
uz: 15. Javobgarlikni cheklash

source: 16. Data Protection & Privacy
uz: 16. Ma'lumotlarni himoya qilish va maxfiylik

source: 17. Anti-Fraud & Security Monitoring
uz: 17. Firibgarlikka qarshi va xavfsizlik monitoringi

source: 18. Force Majeure
uz: 18. Fors-major

source: 19. Amendments
uz: 19. O'zgartirishlar

source: 20. Governing Law & Disputes
uz: 20. Qo'llaniladigan qonun va nizolar

source: 21. Contact Information
uz: 21. Aloqa ma'lumotlari

source: By accessing or using this website (the "Platform"), placing an order, creating an account, submitting an advance payment or donation, or downloading a digital design asset, you irrevocably agree to this Public Offer (the "Agreement"). If you disagree with any clause, you must cease usage immediately. Your continued use constitutes ongoing acceptance.
uz: Ushbu veb-saytdan ("Platforma") foydalanish, buyurtma berish, hisob yaratish, oldindan to'lov yoki xayriya yuborish yoki raqamli dizayn aktivini yuklab olish orqali siz ushbu Ommaviy ofertaga ("Shartnoma") qaytarib bo'lmaydigan tarzda rozilik bildirasiz. Agar biror bandga rozi bo'lmasangiz, darhol foydalanishni to'xtating. Foydalanishni davom ettirishingiz ushbu shartlarni qabul qilganingizni anglatadi.

source: <strong>"Products"</strong> – physical computer hardware listed in the Store. <strong>"Design Assets"</strong> – downloadable or licensable digital works provided via the Marketplace. <strong>"Advance Payment"</strong> – voluntary pre-payment or contribution processed through the Advance Payment module. <strong>"User"</strong> – any natural or legal person accessing the Platform. <strong>"Account"</strong> – personalized access credentials enabling orders and reviews.
uz: <strong>"Mahsulotlar"</strong> – Do'konda keltirilgan fizik kompyuter jihozlari. <strong>"Dizayn aktivlari"</strong> – Marketplace orqali taqdim etiladigan yuklab olinadigan yoki litsenziyalanuvchi raqamli ishlar. <strong>"Oldindan to'lov"</strong> – Oldindan to'lov modulida qayta ishlanadigan ixtiyoriy avans yoki hissa. <strong>"Foydalanuvchi"</strong> – Platformaga kiradigan har qanday jismoniy yoki yuridik shaxs. <strong>"Hisob"</strong> – buyurtmalar va sharhlarni amalga oshirish imkonini beruvchi shaxsiy kirish ma'lumotlari.

source: We provide: (a) an e-commerce interface for purchasing hardware Products; (b) a curated Marketplace for Design Assets; (c) a session-based cart enabling combined checkout; and (d) an optional Advance Payment feature. We reserve the right to modify available Products, pricing, and features without prior notice.
uz: Biz taqdim etamiz: (a) apparat Mahsulotlarini sotib olish uchun e-tijorat interfeysi; (b) Dizayn aktivlari uchun tanlangan Marketplace; (c) birgalikda to'lovni ta'minlovchi sessiya asosidagi savat; va (d) ixtiyoriy Oldindan to'lov funksiyasi. Ogohlantirmasdan Mahsulotlar, narx va funksiyalarni o'zgartirish huquqini saqlab qolamiz.

source: All listings include indicative specifications, pricing, discount data and media. While we strive for accuracy, minor discrepancies (e.g., color tone, packaging) may occur. Stock status is dynamic; placement of items in a cart does not reserve inventory until order confirmation.
uz: Barcha ro'yxatlar taxminiy texnik tavsiflar, narx, chegirma ma'lumotlari va media materiallarni o'z ichiga oladi. Aniqlikka intilsak ham, kichik farqlar (rang ohangi, o'ram va h.k.) bo'lishi mumkin. Ombor holati dinamik; savatga qo'yish buyurtma tasdiqlanmaguncha zaxirani band qilmaydi.

source: Prices are shown in the local currency unless otherwise stated and may change before order acceptance. Percentage discount calculations are based on the pre-discount list price. Advance Payments are discretionary and do not grant equity or ownership; they may be applied toward future purchases at our discretion or treated as goodwill support.
uz: Agar boshqacha ko'rsatilmagan bo'lsa, narxlar mahalliy valyutada ko'rsatiladi va buyurtma qabul qilinishidan oldin o'zgarishi mumkin. Chegirma foizlari chegirmagacha bo'lgan ro'yxat narxiga asoslanadi. Oldindan to'lovlar ixtiyoriy bo'lib, ulush yoki mulk huquqini bermaydi; kelajakdagi xaridlarga bizning ixtiyorimizga ko'ra qo'llanishi yoki goodwill ko'magi sifatida qaralishi mumkin.

source: Order steps: (1) Add items (physical or digital) / choose optional Advance Payment; (2) Review cart; (3) Provide checkout details; (4) Submit payment; (5) Receive confirmation. We may decline or cancel orders (e.g., suspected fraud, pricing errors, regulatory concerns) with refund where payment has settled.
uz: Buyurtma bosqichlari: (1) Tovarlarni (fizik yoki raqamli) qo'shish / ixtiyoriy Oldindan to'lovni tanlash; (2) Savatni ko'rib chiqish; (3) To'lov ma'lumotlarini kiritish; (4) To'lovni yuborish; (5) Tasdiq olish. Firibgarlik gumoni, narx xatosi yoki boshqa sabablar bo'lsa, to'lov o'tgan bo'lsa qaytarish bilan buyurtma rad etilishi yoki bekor qilinishi mumkin.

source: Supported payment channels are listed at checkout. Transactions are processed through vetted third-party providers using encrypted transport. We do not store raw card numbers. You agree not to use payment instruments without proper authorization.
uz: Qo'llab-quvvatlanadigan to'lov kanallari to'lov sahifasida ko'rsatiladi. Tranzaksiyalar shifrlangan uzatish orqali tekshirilgan uchinchi tomon provayderlari tomonidan amalga oshiriladi. Karta raqamlarini saqlamaymiz. Ruxsatsiz to'lov vositalaridan foydalanmaslikka rozilik bildirasiz.

source: Physical Products ship per carrier timelines displayed at checkout; risk of loss transfers upon carrier acceptance. Digital Design Assets are delivered via authenticated download or licensed access; license is non-exclusive, non-transferable and revocable upon breach.
uz: Fizik Mahsulotlar to'lov sahifasida ko'rsatilgan tashuvchi muddatlariga muvofiq jo'natiladi; yo'qotish xavfi tashuvchi qabul qilganda o'tadi. Raqamli Dizayn aktivlari autentifikatsiyalangan yuklab olish yoki litsenziyalangan kirish orqali yetkaziladi; litsenziya mutlaq bo'lmagan, o'tkazilmaydigan va buzilish bo'lsa bekor qilinadi.

source: You must maintain accurate profile data, safeguard credentials, and promptly report unauthorized use. We may suspend accounts exhibiting abusive, fraudulent or security-compromising behavior.
uz: Profil ma'lumotlarini aniq saqlang, kirish ma'lumotlarini himoya qiling va ruxsatsiz foydalanishni zudlik bilan xabar bering. Suiiste'mol yoki xavfli xatti-harakatlarda hisob vaqtincha to'xtatilishi mumkin.

source: Reviews must reflect genuine personal experience and comply with applicable law. We may moderate or remove content that is misleading, defamatory, obscene, infringing, spam-like, or violates this Agreement. One review per Product or Asset per account (editable thereafter).
uz: Sharhlar haqiqiy shaxsiy tajribaga asoslanishi va amaldagi qonunlarga mos bo'lishi kerak. Chalg'ituvchi, tuhmatli, odobsiz, huquqbuzar, spamga o'xshash yoki ushbu Shartnomani buzuvchi kontent o'chirilishi yoki tahrirlanishi mumkin. Har bir mahsulot/aktiv uchun hisobga bitta sharh (keyin tahrirlanadi).

source: All trademarks, logos, interface design, code, product data and Design Assets (unless otherwise attributed) remain our or the respective creator’s intellectual property. Unauthorized reproduction, scraping, or automated extraction is prohibited.
uz: Barcha savdo belgilari, logotiplar, interfeys dizayni, kod, mahsulot ma'lumotlari va Dizayn aktivlari (boshqa ko'rsatilmagan bo'lsa) bizga yoki muallifga tegishli intellektual mulkdir. Ruxsatsiz ko'paytirish yoki avtomatlashtirilgan yig'ish taqiqlanadi.

source: Except where mandated by law, the Platform and content are provided "AS IS" without warranties (express or implied) including merchantability, fitness for a particular purpose, title, or non-infringement. Hardware manufacturer warranties may apply separately.
uz: Qonun talab qilgan holatlar bundan mustasno, Platforma va kontent hech qanday kafolatlarsiz (aniq yoki nazarda tutilgan) 'HOZIRGI HOLATIDA' taqdim etiladi, shu jumladan sotuvga yaroqlilik, maqsadga muvofiqlik, nom yoki buzmaslik kafolatlari. Qurilma ishlab chiqaruvchi kafolatlari alohida qo'llanilishi mumkin.

source: Eligible physical Products may be returned in original condition within the statutory window (unless classified as final sale). Digital Assets and Advance Payments are generally non-refundable once accessed or booked, except where required by consumer protection rules or in cases of confirmed technical defect.
uz: Mos fizik Mahsulotlar qonunda belgilangan muddat ichida asl holatda qaytarilishi mumkin (yakuniy sotuv bo'lmasa). Raqamli aktivlar va Oldindan to'lovlar odatda foydalanilgandan yoki bron qilingandan so'ng qaytarilmaydi, iste'molchini himoya qilish qoidalari yoki tasdiqlangan texnik nuqson bundan mustasno.

source: Advance Payments are voluntary and processed like a standalone cart line. They don’t constitute purchase of goods unless later applied at checkout per an explicit program. Misuse (e.g., money laundering attempts) will result in reversal and possible reporting.
uz: Oldindan to'lovlar ixtiyoriy va alohida savat qatori sifatida qayta ishlanadi. Ular keyinchalik aniq dastur bo'yicha qo'llanilmaguncha tovar sotib olish emas. Noto'g'ri foydalanish (masalan, pul yuvish) bekor qilinishi va xabar qilinishi mumkin.

source: To the maximum extent permitted, aggregate liability for any claims arising out of Platform use shall not exceed the greater of: (a) the total fees paid for the disputed order; or (b) the amount of the Advance Payment linked to the claim. We are not liable for indirect, incidental, special or consequential damages.
uz: Ruxsat etilgan eng katta darajada Platformadan foydalanishdan kelib chiqadigan talablar bo'yicha umumiy javobgarlik quyidagidan oshmaydi: (a) nizoli buyurtma uchun to'langan jami summa; yoki (b) talabga bog'liq Oldindan to'lov miqdori. Bilvosita yoki oqibat zararlari uchun javobgar emasmiz.

source: Personal data is processed under our Privacy Policy (available separately) for legitimate operational, security, and communication purposes. You consent to necessary cross-border data transfers where applicable safeguards exist.
uz: Shaxsiy ma'lumotlar Maxfiylik siyosatimiz asosida qonuniy operatsion, xavfsizlik va aloqa maqsadlari uchun qayta ishlanadi. Siz tegishli himoya choralari mavjud bo'lsa, zarur transchegaraviy uzatishlarga rozilik bildirasiz.

source: We implement automated and manual review layers to detect anomalous patterns (bulk account creation, scripted cart manipulation, abnormal payment attempts). Confirmed abuse may trigger suspension and law enforcement referral.
uz: G'ayrioddiy naqshlarni aniqlash uchun avtomatik va qo'lda tekshiruv qatlamlari qo'llaniladi (ko'p hisob yaratish, skript orqali savatni boshqarish, noodatiy to'lov urinishlari). Tasdiqlangan suiiste'mol hisobni to'xtatish va tegishli organlarga xabar berishga olib kelishi mumkin.

source: Performance delays or failures caused by events beyond reasonable control (natural disasters, power failures, cyber incidents, regulatory actions, supply chain disruption) shall not constitute breach. Obligations resume once impediment ends.
uz: Oqilona nazoratdan tashqaridagi hodisalar (tabiiy ofat, elektr uzilishi, kiber hodisa, tartibga solish choralari, ta'minot zanjiri uzilishi) tufayli kechikish yoki bajarilmaslik buzilish hisoblanmaydi. To'siq tugashi bilan majburiyatlar davom etadi.

source: We may revise this Offer by posting an updated version with a new effective date. Material revisions will, where feasible, include a notice banner. Continued usage following publication constitutes acceptance.
uz: Biz ushbu Ofertani yangi kuchga kirish sanasi bilan yangilangan versiyani joylashtirish orqali o'zgartirishimiz mumkin. Muhim o'zgarishlar imkon bo'lsa ogohlantirish banneri bilan beriladi. E'lon qilingandan so'ng foydalanishni davom ettirish qabul qilinganini anglatadi.

source: Applicable governing law is determined by our principal place of business unless mandatory consumer jurisdiction rules apply. Parties shall first attempt amicable resolution; failing that, disputes proceed to competent courts of general jurisdiction.
uz: Majburiy iste'molchi yurisdiksiya qoidalari qo'llanilmasa, qo'llaniladigan qonun bizning asosiy faoliyat joyimiz bilan belgilanadi. Tomonlar avval o'zaro kelishishga urinishadi; bo'lmasa nizo vakolatli umumiy sudlarga o'tadi.

source: Questions, legal notices, or data requests: <a href="mailto:support@example.com">support@example.com</a>. Physical correspondence address available upon legitimate written request.
uz: Savollar, huquqiy bildirishnomalar yoki ma'lumot so'rovlari: <a href="mailto:support@example.com">support@example.com</a>. Jismoniy pochta manzili asosli yozma so'rov bilan beriladi.

source: Need a copy?
uz: Nusxa kerakmi?

source: You may print or store this page locally. Continued use of the Platform signifies ongoing acceptance of the latest version of these terms.
uz: Siz ushbu sahifani chop etishingiz yoki lokal saqlashingiz mumkin. Platformadan foydalanishni davom ettirish ushbu shartlarning so'nggi versiyasini qabul qilishni anglatadi.

source: Product Store
uz: Mahsulot do'koni

source: Browse & discover
uz: Ko'ring va kashf qiling

source: Search products...
uz: Mahsulotlarni qidiring...

source: All Categories
uz: Barcha kategoriyalar

source: / page
uz: / sahifa

source: Company Legal & Banking Information
uz: Kompaniyaning yuridik va bank ma'lumotlari

source: The following table summarizes the officially registered corporate and banking details of the service provider for reference in contractual / public offer contexts.
uz: Quyidagi jadval xizmat ko'rsatuvchi provayderning shartnoma / ommaviy oferta uchun rasmiy ro'yxatdan o'tgan yuridik va bank ma'lumotlarini jamlaydi.

source: Field
uz: Maydon

source: Full Company Name
uz: To'liq kompaniya nomi

source: Short Name
uz: Qisqa nom

source: TIN (STIR)
uz: STIR

source: Registration Date
uz: Ro'yxatdan o'tgan sana

source: Registration Number
uz: Ro'yxat raqami

source: Legal Form
uz: Tashkiliy-huquqiy shakli

source: Registered Address
uz: Yuridik manzil

source: Issued By
uz: Tashkilot

source: Bank Name
uz: Bank nomi

source: Bank Branch
uz: Bank filiali

source: Bank Address
uz: Bank manzili

source: Bank Phone
uz: Bank telefoni

source: Bank TIN
uz: Bank STIR

source: Bank Accounts
uz: Bank hisoblari

source: Deposit account (UZS)
uz: Depozit hisobi (UZS)

source: Deposit account (USD)
uz: Depozit hisobi (USD)

source: Blocked conversion account (UZS)
uz: Bloklangan konvertatsiya hisobi (UZS)

source: Special conversion account (USD)
uz: Maxsus konvertatsiya hisobi (USD)

source: Transit salary account (Uzcard)
uz: Tranzit ish haqi hisobi (Uzcard)

source: Opened:
uz: Ochilgan:

source: View Cart
uz: Savatni ko'rish

source: Contribute a custom amount and proceed to checkout.
uz: Ixtiyoriy summani kiriting va to'lovga o'ting.

source: The Email must be set
uz: Email kiritilishi shart

source: Superuser must have is_staff=True.
uz: Superuser uchun is_staff=True bo'lishi kerak.

source: Superuser must have is_superuser=True.
uz: Superuser uchun is_superuser=True bo'lishi kerak.

source: email address
uz: elektron pochta manzili

source: first name
uz: ism

source: last name
uz: familiya

source: Subject
uz: Mavzu

source: Created at
uz: Yaratilgan vaqt

source: Contact
uz: Aloqa

source: Contacts
uz: Aloqalar

source: Title
uz: Sarlavha

source: Content
uz: Kontent

source: Blogs
uz: Bloglar

source: Messages
uz: Xabarlar

source: Site Maps
uz: Sayt xaritalari

source: Static Files
uz: Statik fayllar

source: Syndication
uz: Sindikatsiya

source: That page number is not an integer
uz: Sahifa raqami butun son emas
